# Задача №39. Решение в группах
# Даны два массива чисел. Требуется вывести те элементы
# первого массива (в том порядке, в каком они идут в первом
# массиве), которых нет во втором массиве. Пользователь вводит
# число N - количество элементов в первом массиве, затем N
# чисел - элементы массива. Затем число M - количество
# элементов во втором массиве. Затем элементы второго массива
# Ввод: Вывод:
# 7 3 3 2 12
# 3 1 3 4 2 4 12
# 6
# 4 15 43 1 15 1 (каждое число вводится с новой строки)

# from random import randint


# print( randMassive1:= [randint(-5,10) for _ in range(5)] )
# print( randMassive2:= [randint(-5,10) for _ in range(5)] )

# print([i for i in randMassive1 if i not in randMassive2])

# Задача №41. Решение в группах
# Дан массив, состоящий из целых чисел. Напишите
# программу, которая в данном массиве определит
# количество элементов, у которых два соседних и, при
# этом, оба соседних элемента меньше данного. Сначала
# вводится число N — количество элементов в массиве
# Далее записаны N чисел — элементы массива. Массив
# состоит из целых чисел.
# Ввод: Ввод:
# 5 5
# 1 2 3 4 5 1 5 1 5 1
# Вывод: Вывод:
# 0 2
# (каждое число вводится с новой строки)

# lst1 = [1, 5, 1, 5, 1, 5]

# print(sum([1 for i in range(len(lst1)) if lst1[i - 1] < lst1[i] and lst1[i] > lst1[(i + 1) % len(lst1)]]))

# Задача №43. Решение в группах
# Дан список чисел. Посчитайте, сколько в нем пар
# элементов, равных друг другу. Считается, что любые
# два элемента, равные друг другу образуют одну пару,
# которую необходимо посчитать. Вводится список
# чисел. Все числа списка находятся на разных
# строках.
# Ввод: Вывод:
# 1 2 3 2 3 2

# lst1 = [1,2,3,4,3,2]
# print(sum([lst1.count(i) // 2 for i in set(lst1)]))

# Задача №45. Решение в группах
# Два различных натуральных числа n и m называются
# дружественными, если сумма делителей числа n
# (включая 1, но исключая само n) равна числу m и
# наоборот. Например, 220 и 284 – дружественные числа.
# По данному числу k выведите все пары дружественных
# чисел, каждое из которых не превосходит k. Программа
# получает на вход одно натуральное число k, не
# превосходящее 105
# . Программа должна вывести все
# пары дружественных чисел, каждое из которых не
# превосходит k. Пары необходимо выводить по одной в
# строке, разделяя пробелами. Каждая пара должна быть
# выведена только один раз (перестановка чисел новую
# пару не дает).
# Ввод: Вывод:
# 300 220 284

k = 300 # int(input("Enter the number: "))

def find_sum_divisors(number):
    total_sum = 0
    for i in range(1, int(number**0.5)+1):
        if number % i == 0:
            total_sum  += i
            if i != number // i:
                total_sum += (number // i)

    return total_sum-number

print(*((i, first) for i in range(2, k + 1)
        if i == find_sum_divisors(first := find_sum_divisors(i)) and i < first))


